# Dataframe drop

 - drop을 하는 방법 열/행/value

In [1]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

### Drop an observation (row)

In [2]:
df.drop(['Cochice', 'Pima'])

            name  reports  year
Santa Cruz  Tina       31  2013
Maricopa    Jake        2  2014
Yuma         Amy        3  2014

 - 'Chochice', 'Pima' 두 행 을 지운다.

### Drop a row by row number

In [3]:
df.drop(df.index[[2,3]])

          name  reports  year
Cochice  Jason        4  2012
Pima     Molly       24  2012
Yuma       Amy        3  2014

 - row index 를 통해 drop

### Drop a variable (column)
 - axix =1 을 하면 열기준 drop 가능

In [4]:
df.drop('reports', axis=1)

             name  year
Cochice     Jason  2012
Pima        Molly  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

### Drop a row if it contains a certain value (in this case, “Tina”)
 - value 를 통해 drop!!

In [5]:
df[df.name != 'Tina']

           name  reports  year
Cochice   Jason        4  2012
Pima      Molly       24  2012
Maricopa   Jake        2  2014
Yuma        Amy        3  2014

drop method가 아닌 조건문 filtering 을 통해  drop 가능합니다.